Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/svd/PIC32CM1216LE00100.svd
            <register>
               <name>PID5</name>
               <description>Peripheral Identification 5</description>
               <addressOffset>0x1FD4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PID6</name>
               <description>Peripheral Identification 6</description>
               <addressOffset>0x1FD8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PID7</name>
               <description>Peripheral Identification 7</description>
               <addressOffset>0x1FDC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PID0</name>
               <description>Peripheral Identification 0</description>
               <addressOffset>0x1FE0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000D0</resetValue>
               <fields>
                  <field>
                     <name>PARTNBL</name>
                     <description>Part Number Low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID1</name>
               <description>Peripheral Identification 1</description>
               <addressOffset>0x1FE4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000FC</resetValue>
               <fields>
                  <field>
                     <name>PARTNBH</name>
                     <description>Part Number High</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>JEPIDCL</name>
                     <description>Low part of the JEP-106 Identity Code</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID2</name>
               <description>Peripheral Identification 2</description>
               <addressOffset>0x1FE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000009</resetValue>
               <fields>
                  <field>
                     <name>JEPIDCH</name>
                     <description>JEP-106 Identity Code High</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JEPU</name>
                     <description>JEP-106 Identity Code is used</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Revision Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID3</name>
               <description>Peripheral Identification 3</description>
               <addressOffset>0x1FEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CUSMOD</name>
                     <description>ARM CUSMOD</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVAND</name>
                     <description>Revision Number</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID0</name>
               <description>Component Identification 0</description>
               <addressOffset>0x1FF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLEB0</name>
                     <description>Preamble Byte 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID1</name>
               <description>Component Identification 1</description>
               <addressOffset>0x1FF4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLE</name>
                     <description>Preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CCLASS</name>
                     <description>Component Class</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID2</name>
               <description>Component Identification 2</description>
               <addressOffset>0x1FF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLEB2</name>
                     <description>Preamble Byte 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CID3</name>
               <description>Component Identification 3</description>
               <addressOffset>0x1FFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
               <fields>
                  <field>
                     <name>PREAMBLEB3</name>
                     <description>Preamble Byte 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
